examples/interFoam-damBreak-v2512/Allrun
#!/bin/sh
cd "${0%/*}" || exit
blockMesh && setFields && interFoam && foamToVTK
